import React from "react";
import "../../styles/regulations/regulations.css"
import {Helmet} from "react-helmet";
import {HelmetProvider} from "react-helmet-async";


const PrivacyPolicy: React.FC = () => {
    return (
        <div className="page_content">
            <HelmetProvider>
                <Helmet
                    title="Политика конфиденциальности"
                />
            </HelmetProvider>
            <div className="regulations">
                <h1>Политика конфиденциальности и обработки персональных данных</h1>
                <p>г. Самара "22" мая 2025 г.</p>
                <p>Настоящая Политика конфиденциальности и обработки персональных данных (далее - Политика
                    конфиденциальности) является неотъемлемой частью Публичной оферты, размещенной на сайте в сети
                    Интернет по адресу: <a href="https://ivlev-ff.ru">https://ivlev-ff.ru</a> (далее - Сайт).</p>
                <p>Политика конфиденциальности составлена в соответствии с требованиями Федерального закона от
                    27.07.2006. № 152-ФЗ «О персональных данных» (далее — Закон о персональных данных) и определяет
                    порядок обработки персональных данных и меры по обеспечению безопасности персональных данных.
                </p>
                <p>Использование сервисов Сайта означает безоговорочное согласие Пользователя с настоящей Политикой и
                    указанными в ней условиями обработки его персональной информации; в случае несогласия с этими
                    условиями Пользователь должен воздержаться от использования сервисов.
                </p>

                <h2>1. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
                <ol>
                    <li>В рамках настоящей Политики под персональной информацией Пользователя понимаются:
                    </li>
                    <ol>
                        <li> Персональная информация, которую Пользователь предоставляет о себе самостоятельно при
                            регистрации (создании учетной записи) или в процессе использования Сервисов, включая
                            персональные данные Пользователя. Обязательная для предоставления Сервисов информация
                            помечена специальным образом.
                        </li>
                        <li>Данные, которые автоматически передаются сервисам Сайта в процессе их использования с
                            помощью установленного на устройстве Пользователя программного обеспечения, в том числе
                            IP-адрес, данные файлов cookie, информация о браузере Пользователя (или иной программе, с
                            помощью которой осуществляется доступ к сервисам), технические характеристики оборудования и
                            программного обеспечения, используемых Пользователем, дата и время доступа к сервисам,
                            адреса запрашиваемых страниц и иная подобная информация
                        </li>
                        <li>Настоящая Политика конфиденциальности применяется только к Сайту https://ivlev-ff.ru. Сайт
                            https://ivlev-ff.ru не контролирует и не несет ответственности за сайты третьих лиц, на
                            которые Пользователь может перейти по ссылкам, доступным на Сайте https://ivlev-ff.ru.
                        </li>
                    </ol>
                    <li>Администрация не проверяет достоверность персональных данных, предоставляемых Пользователем.
                    </li>
                </ol>

                <h2>2. ЦЕЛИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ</h2>
                <ol>
                    <li>Сайт собирает и хранит только ту персональную информацию, которая необходима для предоставления
                        сервисов или исполнения соглашений и договоров с Пользователем, за исключением случаев, когда
                        законодательством предусмотрено обязательное хранение персональной информации в течение
                        определенного законом срока. <br/>
                        В случае получения уведомления от Пользователя об отзыве согласия на обработку персональных
                        данных Сайт прекращает обработку персональных данных Пользователя в срок, не превышающий 10
                        рабочих дней с момента получения. <br/>
                        Уведомление об отзыве согласия на обработку персональных данных направляется на адрес
                        электронной почты: info@ivlev-ff.ru.
                    </li>
                    <li>Персональную информацию Пользователя Сайт обрабатывает в следующих целях:
                    </li>
                    <ol>
                        <li>Идентификации Пользователя, зарегистрированного на Сайте, для ознакомления с услугами и их
                            получения Пользователем.
                        </li>
                        <li>Предоставления Пользователю доступа к персонализированным ресурсам Сайта.
                        </li>
                        <li>Установления с Пользователем обратной связи, включая направление уведомлений, запросов,
                            касающихся использования Сайта, оказания услуг, обработку запросов и заявок от Пользователя.
                        </li>
                        <li>Определения места нахождения Пользователя для обеспечения безопасности, предотвращения
                            мошенничества.
                        </li>
                        <li> Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем.
                        </li>
                        <li>Создания учетной записи для получения услуг, если Пользователь дал согласие на создание
                            учетной записи.
                        </li>
                        <li>Предоставления Пользователю эффективной клиентской и технической поддержки при возникновении
                            проблем, связанных с использованием Сайта.
                        </li>
                        <li>Осуществления рекламной деятельности с согласия Пользователя.</li>
                    </ol>
                </ol>

                <h2>3. УСЛОВИЯ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ И ЕЕ ПЕРЕДАЧИ ТРЕТЬИМ ЛИЦАМ</h2>
                <ol>
                    <li>Сайт хранит персональную информацию Пользователей в соответствии с внутренними регламентами
                        конкретных сервисов.
                    </li>
                    <li> В отношении персональной информации Пользователя сохраняется ее конфиденциальность, кроме
                        случаев добровольного предоставления Пользователем информации о себе для общего доступа
                        неограниченному кругу лиц. При использовании отдельных сервисов Пользователь соглашается с тем,
                        что определенная часть его персональной информации становится общедоступной.
                    </li>
                    <li>Сайт вправе передать персональную информацию Пользователя третьим лицам в следующих случаях:
                    </li>
                    <ol>
                        <li>Пользователь выразил согласие на такие действия.
                        </li>
                        <li>Передача необходима для использования Пользователем определенного сервиса либо для
                            исполнения определенного соглашения или договора с Пользователем.
                        </li>
                        <li>Передача предусмотрена российским или иным применимым законодательством в рамках
                            установленной законодательством процедуры.
                        </li>
                        <li>В случае продажи Сайта к приобретателю переходят все обязательства по соблюдению условий
                            настоящей Политики применительно к полученной им персональной информации.
                        </li>
                    </ol>
                    <li>Обработка персональных данных Пользователя осуществляется без ограничения срока следующими
                        способами: сбор, запись, систематизация, накопление, хранение, уточнение (обновление,
                        изменение), извлечение, использование, передача (распространение, предоставление, доступ),
                        обезличивание, блокирование, удаление, уничтожение персональных данных, в том числе в
                        информационных системах персональных данных с использованием средств автоматизации или без
                        использования таких средств. Обработка персональных данных Пользователей осуществляется в
                        соответствии с Федеральным законом от 27.07.2006 N 152-ФЗ "О персональных данных".
                    </li>
                    <li>При утрате или разглашении персональных данных Администрация Сайта информирует Пользователя об
                        утрате или разглашении персональных данных.
                    </li>
                    <li>Администрация Сайта принимает необходимые организационные и технические меры для защиты
                        персональной информации Пользователя от неправомерного или случайного доступа, уничтожения,
                        изменения, блокирования, копирования, распространения, а также от иных неправомерных действий
                        третьих лиц.
                    </li>
                    <li>Администрация Сайта совместно с Пользователем принимает все необходимые меры по предотвращению
                        убытков или иных отрицательных последствий, вызванных утратой или разглашением персональных
                        данных Пользователя.
                    </li>
                    <li>Администрация сайта осуществляет автоматизированную обработку персональных данных с получением
                        и/или передачей полученной информации по информационно-телекоммуникационным сетям или без
                        таковой.
                    </li>
                    <li>При утрате или разглашении персональных данных Администрация вправе не информировать
                        Пользователя об утрате или разглашении персональных данных.
                    </li>
                </ol>

                <h2>4. ОБЯЗАТЕЛЬСТВА СТОРОН</h2>
                <ol>
                    <li>Пользователь обязан:
                    </li>
                    <ol>
                        <li>Предоставить информацию о персональных данных, необходимую для пользования Сайтом.
                        </li>
                        <li>Обновлять, дополнять предоставленную информацию о персональных данных в случае изменения
                            данной информации.
                        </li>
                    </ol>
                    <li>Администрация Сайта обязана:</li>
                    <ol>
                        <li>Использовать полученную информацию исключительно для целей, указанных в настоящей Политике
                            конфиденциальности.
                        </li>
                        <li>Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного
                            письменного разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование
                            либо разглашение иными возможными способами переданных персональных данных Пользователя, за
                            исключением предусмотренных настоящей Политикой конфиденциальности.
                        </li>
                        <li>Для обеспечения защиты персональных данных Пользователя при их обработке приняты правовые,
                            организационные и технические меры от несанкционированного, неправомерного или случайного
                            доступа к персональным данным, уничтожения, изменения, блокирования, копирования,
                            предоставления, распространения персональных данных, а также от иных неправомерных действий
                            в отношении персональных данных.
                        </li>
                        <li>Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с
                            момента обращения или запроса Пользователя или его законного представителя либо
                            уполномоченного органа по защите прав субъектов персональных данных на период проверки в
                            случае выявления недостоверных персональных данных или неправомерных действий.
                        </li>
                    </ol>
                </ol>

                <h2>5. ОТВЕТСТВЕННОСТЬ СТОРОН</h2>
                <ol>
                    <li>Администрация Сайта, не исполнившая свои обязательства, несет ответственность за убытки,
                        понесенные Пользователем в связи с неправомерным использованием персональных данных, в
                        соответствии с законодательством Российской Федерации.
                    </li>
                    <li>В случае утраты или разглашения конфиденциальной информации Администрация Сайта не несет
                        ответственности, если данная конфиденциальная информация:
                    </li>
                    <ol>
                        <li> Стала публичным достоянием до ее утраты или разглашения.
                        </li>
                        <li>Была получена от третьей стороны до момента ее получения Администрацией Сайта.
                        </li>
                        <li>Была разглашена с согласия Пользователя.
                        </li>
                        <li>Была разглашена без вины Администрации Сайта по независящим обстоятельствам при выполнении
                            всех необходимых мер по сохранности Информации.
                        </li>
                    </ol>
                </ol>

                <h2>6. РАЗРЕШЕНИЕ СПОРОВ</h2>
                <ol>
                    <li>До обращения в суд с иском по спорам, возникающим из отношений между Пользователем Сайта и
                        Администрацией Сайта, обязательным является предъявление претензии (письменного предложения о
                        добровольном урегулировании спора).
                    </li>
                    <li>Получатель претензии в течение 30 календарных дней со дня получения претензии письменно
                        уведомляет заявителя претензии о результатах рассмотрения претензии.
                    </li>
                    <li>При недостижении соглашения спор будет передан на рассмотрение в суд в соответствии с
                        действующим законодательством Российской Федерации.
                    </li>
                    <li>К настоящей Политике конфиденциальности и отношениям между Пользователем и Администрацией Сайта
                        применяется действующее законодательство Российской Федерации.
                    </li>
                </ol>

                <h2>7. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</h2>
                <ol>
                    <li>Администрация Сайта вправе вносить изменения в настоящую Политику конфиденциальности без
                        согласия Пользователя.
                    </li>
                    <li>Новая Политика конфиденциальности вступает в силу с момента ее размещения на Сайте, если иное не
                        предусмотрено новой редакцией Политики конфиденциальности.
                    </li>
                    <li>Все предложения или вопросы по настоящей Политике конфиденциальности следует сообщать на
                        электронную почту: info@ivlev-ff.ru.
                    </li>
                    <li>Действующая Политика конфиденциальности размещена на странице по адресу:
                        https://ivlev-ff.ru/privacy_policy.
                    </li>
                    <li>Настоящая Политика конфиденциальности является неотъемлемой частью Публичной оферты размещенной
                        на странице по адресу: https://ivlev-ff.ru/oferta.
                    </li>
                </ol>

                <p>Информация для сведения:</p>
                <p>Согласно ч. 5 ст. 18 Федерального закона от 27.07.2006 N 152-ФЗ "О персональных данных" при сборе
                    персональных данных, в том числе посредством информационно-телекоммуникационной сети Интернет,
                    оператор обязан обеспечить запись, систематизацию, накопление, хранение, уточнение (обновление,
                    изменение), извлечение персональных данных граждан Российской Федерации с использованием баз данных,
                    находящихся на территории Российской Федерации, за исключением случаев, указанных в п. п. 2, 3, 4, 8
                    ч. 1 ст. 6 Федерального закона от 27.07.2006 N 152-ФЗ "О персональных данных".
                </p>
            </div>
        </div>
    )
}

export default PrivacyPolicy;